# MultistoryStairsId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..MultistoryStairsId Property
Stairs Class See Also
---
The id of the MultistoryStairs element to which this element belongs. If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId MultistoryStairsId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MultistoryStairsId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MultistoryStairsId {
	ElementId^ get ();
}
```

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace